template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (-50 -5 0) //0
    (0 -5 0) //1
    (40 -5 0) //2
    (90 -5 0) //3 

    (-50 5 0) //4
    (0 5 0) //5
    (40 5 0) //6
    (90 5 0) //7

    (-50 -5 1) //8
    (0 -5 1) //9
    (40 -5 1) //10
    (90 -5 1) //11

    (-50 5 1) //12 
    (0 5 1) //13
    (40 5 1) //14
    (90 5 1) //15
);

blocks
(
    hex (0 1 5 4 8 9 13 12) (50 20 1) simpleGrading 
        (
        1                  // x-direction expansion ratio
        (
            (0.2 0.3 4)    // 20% y-dir, 30% cells, expansion = 4
            (0.6 0.4 1)    // 60% y-dir, 40% cells, expansion = 1
            (0.2 0.3 0.25) // 20% y-dir, 30% cells, expansion = 0.25 (1/4)
        )
        1
    )
    hex (1 2 6 5 9 10 14 13) (40 20 1) simpleGrading 
        (
        1                  // x-direction expansion ratio
        (
            (0.2 0.3 4)    // 20% y-dir, 30% cells, expansion = 4
            (0.6 0.4 1)    // 60% y-dir, 40% cells, expansion = 1
            (0.2 0.3 0.25) // 20% y-dir, 30% cells, expansion = 0.25 (1/4)
        )
        1
    )
    hex (2 3 7 6 10 11 15 14) (50 20 1) simpleGrading 
        (
        1                  // x-direction expansion ratio
        (
            (0.2 0.3 4)    // 20% y-dir, 30% cells, expansion = 4
            (0.6 0.4 1)    // 60% y-dir, 40% cells, expansion = 1
            (0.2 0.3 0.25) // 20% y-dir, 30% cells, expansion = 0.25 (1/4)
        )
        1
    )
);

edges
();

boundary
(
    inlet
    {
        type mappedPatch;
        offset          (0.01 0 0);
        sampleMode      nearestCell;
        faces
        (
            (0 8 12 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 7 15 11)
        );
    }

    heated_walls
    {
        type wall;
        faces
        (
            (1 2 10 9)
            (5 13 14 6)
        );
    }

    upstream_walls
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (4 12 13 5)
        );
    }

    downstream_walls
    {
        type wall;
        faces
        (
            (2 3 11 10)  //downstream
            (6 14 15 7)  //downstream
        );
    }

    back
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (2 1 5 6)
            (3 2 6 7)
        );
    }
    front
    {
        type wall;
        faces
        (
            (12 8 9 13)
            (13 9 10 14)
            (15 14 10 11) 
        );
    }
);


// ************************************************************************* //
