template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1;

writeControl    timeStep;

writeInterval   10;

purgeWrite      10;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    TemperatureTransport
    {
        type            scalarTransport;
        libs            ( solverFunctionObjects );
        enabled         true;
        writeControl    writeTime;
        writeInterval   1;
        field           T;
        D               1.43e-07;
        write           true;
    }

    // outletUniformity
	// {
    // 	type    	surfaceFieldValue;
    // 	libs    	(fieldFunctionObjects);
    // 	fields  	(U);
    // 	writeFields no;
    // 	log     	true;
    // 	regionType  patch;
    // 	name    	outlet;
    // 	operation   uniformity;
	// }

    outletFluxWeightedTemp
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        writeControl    timeStep;
        writeInterval   1;
        regionType      patch;
        fields          (T);
        name            outlet;
        operation       weightedAverage;
        weightField     phi;
        writeFields     no;
    }

    pDrop
	{
    	type    	surfaceFieldValue;
    	libs    	(fieldFunctionObjects);
        writeControl    timeStep;
        writeInterval   1;
    	fields  	(p);
    	regionType  patch;
    	name    	inlet;
    	operation   areaAverage;
        writeFields     no;
	}
}


// ************************************************************************* //
