template/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    baffleWall
    {
        type         faceZone;
        faceZone     baffles_facezone;
        newPatchName baffleWall;
        zoneName     baffles_facezone;
        addToPatch   true;
        addToZone    true;
        flipNormals  false;
        patchType    wall;
        patchPairs
        {
            type            wall;
            patchFields
            {
                U
                {
                    type            fixedValue;
                    value           uniform (0 0 0);
                }
                p
                {
                    type            zeroGradient;
                }
                T
                {
                    type            zeroGradient;
                }
            }

        }
    }
}